# 前言

这是 Python 入门的第四个系列: Pandas 系列. Pandas 用于处理类似表格一类的数据.
话不多说, 本次学习的原文链接:[盘一盘 Python 系列 4 - Pandas (上)](https://mp.weixin.qq.com/s/8aDKz9c-VsXtDHT-NmSrrQ) [Pandas官网](https://pandas.pydata.org/)

Pandas 里有三个描述数据的类型:
+ Series
+ DataFrame
+ Panel(不学，将会被弃用)

本次学习的框架:
+ 数据表的创建(Series,DataFrame)
+ 数据表的存载(csv,excel)
+ 数据表的获取(索引和切片,at,iat,loc,iloc)
+ 数据表的合并和链接(按 键 合并，按 轴 链接)
+ 数据表的重塑和透视(stack,unstack重塑，pivot,melt透视)

# 1. 数据表的创建

+ 按部就班: pd.Series(),pd.DataFrame(),pd.Panel
+ 一步登天: WindPy API 读取数据

## 按部就班法
### Series

In [1]:
import pandas as pd

#列表
s = pd.Series([27.2, 27.65, 27.70, 28])
s

0    27.20
1    27.65
2    27.70
3    28.00
dtype: float64

In [2]:
#打印 s 中的元素
s.values

array([27.2 , 27.65, 27.7 , 28.  ])

In [3]:
#获取对应索引
s.index

RangeIndex(start=0, stop=4, step=1)

In [4]:
#将日期当作索引
dates = pd.date_range('20190401', periods=4)
s2 = pd.Series([27.2, 27.65, 27.70, 28],index=dates)
s2

2019-04-01    27.20
2019-04-02    27.65
2019-04-03    27.70
2019-04-04    28.00
Freq: D, dtype: float64

In [5]:
s2.values

array([27.2 , 27.65, 27.7 , 28.  ])

In [6]:
s2.index

DatetimeIndex(['2019-04-01', '2019-04-02', '2019-04-03', '2019-04-04'], dtype='datetime64[ns]', freq='D')

In [7]:
#命名
s2.name = '海底捞股价'
s2

2019-04-01    27.20
2019-04-02    27.65
2019-04-03    27.70
2019-04-04    28.00
Freq: D, Name: 海底捞股价, dtype: float64

In [8]:
#用 numpy 数组
import numpy as np

s = pd.Series(np.array([27.2, 27.65, 27.70, 28, 28, np.nan]))
print('The length is ',len(s))
print('The shape is ',s.shape)
print('The count is ',s.count())

The length is  6
The shape is  (6,)
The count is  5

In [9]:
#统计不重复的元素
s.unique()

array([27.2 , 27.65, 27.7 , 28.  ,   nan])

In [10]:
#统计非 nan 出现的次数
s.value_counts()

28.00    2
27.70    1
27.65    1
27.20    1
dtype: int64

Series 中 5 个属性或内置函数的用法:
+ len
+ shape
+ count: 计算不包含 nan 的元素个数
+ unique: 返回不重复的元素
+ value_counts: 统计非 nan 元素出现的个数

In [11]:
#字典

data_dict = {'BABA':187.07,'PDD':21.83,'JD':30.79,'BIDU':184.77}
s3 = pd.Series(data_dict,name='中概股')
s3.index.name = '股票代号'
s3

股票代号
BABA    187.07
PDD      21.83
JD       30.79
BIDU    184.77
Name: 中概股, dtype: float64

In [12]:
stock = ['FB','BABA','PDD','JD']
s4 = pd.Series(data_dict,index=stock)
s4

FB         NaN
BABA    187.07
PDD      21.83
JD       30.79
dtype: float64

In [13]:
s3 + s4

BABA    374.14
BIDU       NaN
FB         NaN
JD       61.58
PDD      43.66
dtype: float64

### DataFrame

可以用下面的命令创建 DataFrame:
+ pd.DataFrame(x,index=idx,columns=col)

In [14]:
#列表或 numpy 数组
df1 = pd.DataFrame([[1,2,3],[4,5,6]])
#df1 = pd.DataFrame(np.array([[1,2,3],[4,5,6]]))
df1

   0  1  2
0  1  2  3
1  4  5  6

In [15]:
#用对象为列表的字典
symbol = ['BABA','JD','AAPL','MS','GS','WMT']
data = {'行业':['电商','电商','科技','金融','金融','零售'],
       '价格':[176.92,25.95,172.97,41.79,196.00,99.55],
       '交易量':[16175610, 27113291, 18913154, 10132145, 2626634, 8086946],
       '雇员':[101550, 175336, 100000, 60348, 36600, 2200000]}
df2 = pd.DataFrame(data,index=symbol)
df2.name = '美股'
df2.index.name = '代号'
df2

      行业      价格       交易量       雇员
代号
BABA  电商  176.92  16175610   101550
JD    电商   25.95  27113291   175336
AAPL  科技  172.97  18913154   100000
MS    金融   41.79  10132145    60348
GS    金融  196.00   2626634    36600
WMT   零售   99.55   8086946  2200000

In [16]:
df2.values

array([['电商', 176.92, 16175610, 101550],
       ['电商', 25.95, 27113291, 175336],
       ['科技', 172.97, 18913154, 100000],
       ['金融', 41.79, 10132145, 60348],
       ['金融', 196.0, 2626634, 36600],
       ['零售', 99.55, 8086946, 2200000]], dtype=object)

In [17]:
df2.columns

Index(['行业', '价格', '交易量', '雇员'], dtype='object')

In [18]:
df2.index

Index(['BABA', 'JD', 'AAPL', 'MS', 'GS', 'WMT'], dtype='object', name='代号')

In [19]:
#查看
df2.head()

      行业      价格       交易量      雇员
代号
BABA  电商  176.92  16175610  101550
JD    电商   25.95  27113291  175336
AAPL  科技  172.97  18913154  100000
MS    金融   41.79  10132145   60348
GS    金融  196.00   2626634   36600

In [21]:
#后三行
df2.tail(3)

     行业      价格       交易量       雇员
代号
MS   金融   41.79  10132145    60348
GS   金融  196.00   2626634    36600
WMT  零售   99.55   8086946  2200000

In [22]:
#统计
df2.describe()

               价格           交易量            雇员
count    6.000000  6.000000e+00  6.000000e+00
mean   118.863333  1.384130e+07  4.456390e+05
std     73.748714  8.717312e+06  8.607522e+05
min     25.950000  2.626634e+06  3.660000e+04
25%     56.230000  8.598246e+06  7.026100e+04
50%    136.260000  1.315388e+07  1.007750e+05
75%    175.932500  1.822877e+07  1.568895e+05
max    196.000000  2.711329e+07  2.200000e+06

In [23]:
#升维
df2.index = pd.MultiIndex.from_tuples(
            [('中国公司','BABA'), ('中国公司','JD'),
             ('美国公司','AAPL'), ('美国公司','MS'),
             ('美国公司','GS'), ('美国公司','WMT')
            ])
df2

           行业      价格       交易量       雇员
中国公司 BABA  电商  176.92  16175610   101550
     JD    电商   25.95  27113291   175336
美国公司 AAPL  科技  172.97  18913154   100000
     MS    金融   41.79  10132145    60348
     GS    金融  196.00   2626634    36600
     WMT   零售   99.55   8086946  2200000

## 一步登天法

跳过

# 数据表的存载

保存
+ to_excel()
+ to_csv()
+ to_sql()
+ to_hdf()

加载
+ read_excel()
+ read_csv()
+ read_hdf()

## Excel 格式

pd.to_excel('file_name','sheet_name')

In [25]:
df = pd.DataFrame(np.array([[1,2,3],[4,5,6]]))
df.to_excel('pd_excel.xlsx',sheet_name='Sheet1')

In [26]:
df1 = pd.read_excel('pd_excel.xlsx',sheet_name='Sheet1')
df1

   0  1  2
0  1  2  3
1  4  5  6

## csv 格式

In [28]:
data = {'Code':['BABA','00700.HK','AAPL','600519.SH'],
       'Name':['阿里巴巴','腾讯','苹果','茅台'],
       'Market':['US','HK','US','SH'],
       'Price':[185.35,380.2,197,900.2],
       'Currency':['USD','HKD','USD','CNY']}
df = pd.DataFrame(data)
df.to_csv('pd_csv.csv',index=False)

In [29]:
df2 = pd.read_csv('pd_csv.csv')
df2

        Code  Name Market   Price Currency
0       BABA  阿里巴巴     US  185.35      USD
1   00700.HK    腾讯     HK  380.20      HKD
2       AAPL    苹果     US  197.00      USD
3  600519.SH    茅台     SH  900.20      CNY

# 3.数据表的索引和切片

In [30]:
symbol = ['BABA','JD','AAPL','MS','GS','WMT']
data = {'行业':['电商','电商','科技','金融','金融','零售'],
       '价格':[176.92,25.95,172.97,41.79,196.00,99.55],
       '交易量':[16175610,27113291,18913154,10132145,2626634,8086946],
       '雇员':[101550,17536,100000,60348,3600,2200000]}
df = pd.DataFrame(data,index=symbol)
df.name = '美股'
df.index.name = '代号'
df

      行业      价格       交易量       雇员
代号
BABA  电商  176.92  16175610   101550
JD    电商   25.95  27113291    17536
AAPL  科技  172.97  18913154   100000
MS    金融   41.79  10132145    60348
GS    金融  196.00   2626634     3600
WMT   零售   99.55   8086946  2200000

## 3.1 索引单元素

+ 基于标签的 df.at['idx_i','attr_j']
+ 基于位置df.iat[i,j]

In [31]:
df.at['AAPL','价格']

172.97

In [32]:
df.iat[2,1]

172.97

## 3.2 切片 columns

+ df.attr_i
+ df['attr_i']
+ df.loc[:,'attr_i']
+ df.iloc[:,i]

In [33]:
df.价格

代号
BABA    176.92
JD       25.95
AAPL    172.97
MS       41.79
GS      196.00
WMT      99.55
Name: 价格, dtype: float64

In [34]:
df['价格']

代号
BABA    176.92
JD       25.95
AAPL    172.97
MS       41.79
GS      196.00
WMT      99.55
Name: 价格, dtype: float64

In [35]:
df.loc[:, '交易量']

代号
BABA    16175610
JD      27113291
AAPL    18913154
MS      10132145
GS       2626634
WMT      8086946
Name: 交易量, dtype: int64

In [36]:
df.iloc[:, 0]

代号
BABA    电商
JD      电商
AAPL    科技
MS      金融
GS      金融
WMT     零售
Name: 行业, dtype: object

### 切片多个 columns

+ df.[['attr_i'],['attr_j']]
+ 基于标签 df.loc[:, 'attr_i':'attr_j']
+ 基于位置 df.iloc[:, i:j]

In [40]:
df[['雇员','价格']]

           雇员      价格
代号
BABA   101550  176.92
JD      17536   25.95
AAPL   100000  172.97
MS      60348   41.79
GS       3600  196.00
WMT   2200000   99.55

In [41]:
df.loc[:, '行业':'交易量']

      行业      价格       交易量
代号
BABA  电商  176.92  16175610
JD    电商   25.95  27113291
AAPL  科技  172.97  18913154
MS    金融   41.79  10132145
GS    金融  196.00   2626634
WMT   零售   99.55   8086946

In [42]:
df.iloc[:,0:2]

      行业      价格
代号
BABA  电商  176.92
JD    电商   25.95
AAPL  科技  172.97
MS    金融   41.79
GS    金融  196.00
WMT   零售   99.55

## 3.3 切片 index
### 切片单个 index

+ 基于标签df.loc['idx_i',:]
+ 基于位置df.iloc[i,:]
+ df[i:i+1]
+ df['idx_i':'idx_i']

In [43]:
df.loc['GS',:]

行业          金融
价格         196
交易量    2626634
雇员        3600
Name: GS, dtype: object

In [44]:
df.iloc[3,:]

行业           金融
价格        41.79
交易量    10132145
雇员        60348
Name: MS, dtype: object

In [45]:
df[1:2]

    行业     价格       交易量     雇员
代号
JD  电商  25.95  27113291  17536

In [46]:
df['JD':'JD']

    行业     价格       交易量     雇员
代号
JD  电商  25.95  27113291  17536

### 切片多个 index

In [47]:
df[1:4]

      行业      价格       交易量      雇员
代号
JD    电商   25.95  27113291   17536
AAPL  科技  172.97  18913154  100000
MS    金融   41.79  10132145   60348

In [48]:
df['GS':'WMT']

     行业      价格      交易量       雇员
代号
GS   金融  196.00  2626634     3600
WMT  零售   99.55  8086946  2200000

In [49]:
df.loc['MS':'GS',:]

    行业      价格       交易量     雇员
代号
MS  金融   41.79  10132145  60348
GS  金融  196.00   2626634   3600

In [50]:
df.loc['MS':'JD',:]

Empty DataFrame
Columns: [行业, 价格, 交易量, 雇员]
Index: []

In [51]:
df.iloc[1:3,:]

      行业      价格       交易量      雇员
代号
JD    电商   25.95  27113291   17536
AAPL  科技  172.97  18913154  100000

## 3.4 切片 index 和 columns

In [52]:
df.loc['GS':'WMT','价格':]

         价格      交易量       雇员
代号
GS   196.00  2626634     3600
WMT   99.55  8086946  2200000

In [53]:
df.iloc[:2,1:3]

          价格       交易量
代号
BABA  176.92  16175610
JD     25.95  27113291

## 3.5 高级索引

+ df.loc[boolean,:]
+ df.iloc[boolean,:]
+ df[boolean]
+ df.locc[call_function,:]
+ df.iloc[call_function,:]
+ df[call_function]

In [54]:
#过滤雇员小于100000人的公司
print(df.雇员 >= 100000)

代号
BABA     True
JD      False
AAPL     True
MS      False
GS      False
WMT      True
Name: 雇员, dtype: bool

In [55]:
df.loc[df.雇员 >= 10000,:]

      行业      价格       交易量       雇员
代号
BABA  电商  176.92  16175610   101550
JD    电商   25.95  27113291    17536
AAPL  科技  172.97  18913154   100000
MS    金融   41.79  10132145    60348
WMT   零售   99.55   8086946  2200000

In [57]:
df[df.雇员 >= 10000]

      行业      价格       交易量       雇员
代号
BABA  电商  176.92  16175610   101550
JD    电商   25.95  27113291    17536
AAPL  科技  172.97  18913154   100000
MS    金融   41.79  10132145    60348
WMT   零售   99.55   8086946  2200000

In [59]:
#找到值为整数型的 columns
print(df.dtypes == 'int64')

行业     False
价格     False
交易量     True
雇员      True
dtype: bool

In [60]:
df.loc[:,df.dtypes == 'int64']

           交易量       雇员
代号
BABA  16175610   101550
JD    27113291    17536
AAPL  18913154   100000
MS    10132145    60348
GS     2626634     3600
WMT    8086946  2200000

In [61]:
#调用函数，找出交易量大于平均数的股票
df.loc[lambda x: x.交易量 > x.交易量.mean(),:]

      行业      价格       交易量      雇员
代号
BABA  电商  176.92  16175610  101550
JD    电商   25.95  27113291   17536
AAPL  科技  172.97  18913154  100000

In [62]:
#价格在 100 之上
df.loc[lambda x: (x.交易量 > x.交易量.mean()) & (x.价格 > 100),:]

      行业      价格       交易量      雇员
代号
BABA  电商  176.92  16175610  101550
AAPL  科技  172.97  18913154  100000

In [63]:
df.价格.loc[lambda x: x>100]

代号
BABA    176.92
AAPL    172.97
GS      196.00
Name: 价格, dtype: float64

## 3.6 多层索引
### Series

In [69]:
price = [190,32,196,192,200,189,31,30,199]
dates = ['2019-04-01']*3 + ['2019-04-02']*2 + ['2019-04-03']*2 + ['2019-04-04']*2
codes = ['BABA','JD','GS','BABA','GS','BABA','JD','JD','GS']

data = pd.Series(price, index=[dates,codes])

In [70]:
data

2019-04-01  BABA    190
            JD       32
            GS      196
2019-04-02  BABA    192
            GS      200
2019-04-03  BABA    189
            JD       31
2019-04-04  JD       30
            GS      199
dtype: int64

In [71]:
data.index

MultiIndex(levels=[['2019-04-01', '2019-04-02', '2019-04-03', '2019-04-04'], ['BABA', 'GS', 'JD']],
           labels=[[0, 0, 0, 1, 1, 2, 2, 3, 3], [0, 2, 1, 0, 1, 0, 2, 2, 1]])

In [72]:
data['2019-04-02']

BABA    192
GS      200
dtype: int64

In [73]:
data.loc['2019-04-02':'2019-04-04']

2019-04-02  BABA    192
            GS      200
2019-04-03  BABA    189
            JD       31
2019-04-04  JD       30
            GS      199
dtype: int64

In [74]:
data.loc[:,'GS']

2019-04-01    196
2019-04-02    200
2019-04-04    199
dtype: int64

### 多层索引 DataFrame

In [76]:
data = [ ['电商',101550,176.92,16175610],
       ['电商',175336,25.95,27113291],
       ['金融',60348,41.79,10132145],
        ['金融',36600,196.00,2626634] ]

midx = pd.MultiIndex(
                    levels=[['中国','美国'],
                            ['BABA','JD','GS','MS']],
                    labels=[[0,0,1,1],[0,1,2,3]],
                    names=['地区','代号'])

mcol = pd.MultiIndex(
                    levels=[['公司数据','交易数据'],
                           ['行业','雇员','价格','交易量']],
                    labels=[[0,0,1,1],[0,1,2,3]],
                    names=['概括','细分'])

df = pd.DataFrame(data, index=midx, columns=mcol)
df

概括      公司数据            交易数据
细分        行业      雇员      价格       交易量
地区 代号
中国 BABA   电商  101550  176.92  16175610
   JD     电商  175336   25.95  27113291
美国 GS     金融   60348   41.79  10132145
   MS     金融   36600  196.00   2626634

In [77]:
df['公司数据','行业']

地区  代号
中国  BABA    电商
    JD      电商
美国  GS      金融
    MS      金融
Name: (公司数据, 行业), dtype: object

In [78]:
df.loc['中国'].loc['BABA':'JD']

概括   公司数据            交易数据
细分     行业      雇员      价格       交易量
代号
BABA   电商  101550  176.92  16175610
JD     电商  175336   25.95  27113291

In [79]:
df.loc['中国']

概括   公司数据            交易数据
细分     行业      雇员      价格       交易量
代号
BABA   电商  101550  176.92  16175610
JD     电商  175336   25.95  27113291

In [80]:
#调位
df.swaplevel('地区','代号')

概括      公司数据            交易数据
细分        行业      雇员      价格       交易量
代号   地区
BABA 中国   电商  101550  176.92  16175610
JD   中国   电商  175336   25.95  27113291
GS   美国   金融   60348   41.79  10132145
MS   美国   金融   36600  196.00   2626634

In [81]:
#调换 columns level 顺序
df.columns = df.columns.swaplevel(0,1)
df

细分        行业      雇员      价格       交易量
概括      公司数据    公司数据    交易数据      交易数据
地区 代号
中国 BABA   电商  101550  176.92  16175610
   JD     电商  175336   25.95  27113291
美国 GS     金融   60348   41.79  10132145
   MS     金融   36600  196.00   2626634

In [82]:
#重设 index
data = {'地区':['中国','中国','美国','美国'],
       '代号':['BABA','JD','MS','GS'],
       '行业':['电商','电商','金融','金融'],
       '价格':[176.92,25.95,41.79,196.00],
       '交易量':[16175610,27113291,10132145,2626634],
       '雇员':[101550,175336,60348,36600]}
df = pd.DataFrame(data)
df

   地区    代号  行业      价格       交易量      雇员
0  中国  BABA  电商  176.92  16175610  101550
1  中国    JD  电商   25.95  27113291  175336
2  美国    MS  金融   41.79  10132145   60348
3  美国    GS  金融  196.00   2626634   36600

In [83]:
#将 地区 和 代号 设置为第一层 index 和第二层 index
df2 = df.set_index(['地区','代号'])
df2

         行业      价格       交易量      雇员
地区 代号
中国 BABA  电商  176.92  16175610  101550
   JD    电商   25.95  27113291  175336
美国 MS    金融   41.79  10132145   60348
   GS    金融  196.00   2626634   36600

In [84]:
df2.reset_index()#重设，即将所有 index 变成 columns

   地区    代号  行业      价格       交易量      雇员
0  中国  BABA  电商  176.92  16175610  101550
1  中国    JD  电商   25.95  27113291  175336
2  美国    MS  金融   41.79  10132145   60348
3  美国    GS  金融  196.00   2626634   36600

# 4. 总结

学会数据表的创建、存载以及数据表的变换等。